OpenFOAMSetting/AijCaseA-Les-LogInlet-Smag-LUST-StrGrid-T200/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

// I have confirmed that these are the only parameters needed for Smagroinsky model.
LES
{
    model           Smagorinsky;
    turbulence      on;
    printCoeffs     on;
    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    SmagorinskyCoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
    }
}

// ************************************************************************* //
