OpenFOAMSetting/AijCaseA-Les-LogInlet-Smag-LUST-StrGrid-T200/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(    
    // k=0 (z=0)
    // 8-----9-----10----11
    // |                 |
    // 4     5-----6     7
    // |     |     |     |
    // 0-----1-----2-----3
    //
    (0 0 0)     // 0
    (20 0 0)    // 1
    (24 0 0)    // 2
    (80 0 0)    // 3
    (0 8 0)     // 4
    (20 8 0)    // 5
    (24 8 0)    // 6
    (80 8 0)    // 7
    (0 40 0)    // 8
    (20 40 0)   // 9
    (24 40 0)   // 10
    (80 40 0)   // 11

    // k=1 (z=18)
    // 20----21----22----23
    // |                 |
    // 16    17----18    19
    // |     |     |     |
    // 12----13----14----15
    //
    (0 0 18)    // 12
    (20 0 18)   // 13
    (24 0 18)   // 14
    (80 0 18)   // 15
    (0 8 18)    // 16
    (20 8 18)   // 17
    (24 8 18)   // 18
    (80 8 18)   // 19
    (0 40 18)   // 20
    (20 40 18)  // 21
    (24 40 18)  // 22
    (80 40 18)  // 23

    // k=2 (z=22)
    // 32----33----34----35
    // |                 |
    // 28    29----30    31
    // |     |     |     |
    // 24----25----26----27
    //
    (0 0 22)    // 24
    (20 0 22)   // 25
    (24 0 22)   // 26
    (80 0 22)   // 27
    (0 8 22)    // 28
    (20 8 22)   // 29
    (24 8 22)   // 30
    (80 8 22)   // 31
    (0 40 22)   // 32
    (20 40 22)  // 33
    (24 40 22)  // 34
    (80 40 22)  // 35

    // k=3 (z=40)
    // 44----45----46----47
    // |                 |
    // 40    41----42    43
    // |     |     |     |
    // 36----37----38----39
    //
    (0 0 40)    // 36
    (20 0 40)   // 37
    (24 0 40)   // 38
    (80 0 40)   // 39
    (0 8 40)    // 40
    (20 8 40)   // 41
    (24 8 40)   // 42
    (80 8 40)   // 43
    (0 40 40)   // 44
    (20 40 40)  // 45
    (24 40 40)  // 46
    (80 40 40)  // 47
);

blocks
(
    // ---------------- z = 0 ~ 18 ----------------
    // Bottom Layer (y = 0 ~ 8)
    hex (0 1 5 4 12 13 17 16)   (29 40 27) simpleGrading (0.116 1 0.135)
    hex (1 2 6 5 13 14 18 17)   (20 40 27) simpleGrading (1 1 0.135)
    hex (2 3 7 6 14 15 19 18)   (41 40 27) simpleGrading (21.7 1 0.135)
    // Top Layer (y = 8 ~ 40)
    hex (4 5 9 8 16 17 21 20)   (29 34 27) simpleGrading (0.116 12.7 0.135)
    hex (5 6 10 9 17 18 22 21)  (20 34 27) simpleGrading (1 12.7 0.135)
    hex (6 7 11 10 18 19 23 22) (41 34 27) simpleGrading (21.7 12.7 0.135)

    // ---------------- z = 18 ~ 22 ----------------
    // Bottom Layer (y = 0 ~ 8)
    hex (12 13 17 16 24 25 29 28) (29 40 20) simpleGrading (0.116 1 1)
    // (13 14 18 17 25 26 30 29) 被挖去，代表建筑实体本身
    hex (14 15 19 18 26 27 31 30) (41 40 20) simpleGrading (21.7 1 1)
    // Top Layer (y = 8 ~ 40)
    hex (16 17 21 20 28 29 33 32) (29 34 20) simpleGrading (0.116 12.7 1)
    hex (17 18 22 21 29 30 34 33) (20 34 20) simpleGrading (1 12.7 1)
    hex (18 19 23 22 30 31 35 34) (41 34 20) simpleGrading (21.7 12.7 1)

    // ---------------- z = 22 ~ 40 ----------------
    // Bottom Layer (y = 0 ~ 8)
    hex (24 25 29 28 36 37 41 40) (29 40 27) simpleGrading (0.116 1 7.4)
    hex (25 26 30 29 37 38 42 41) (20 40 27) simpleGrading (1 1 7.4)
    hex (26 27 31 30 38 39 43 42) (41 40 27) simpleGrading (21.7 1 7.4)
    // Top Layer (y = 8 ~ 40)
    hex (28 29 33 32 40 41 45 44) (29 34 27) simpleGrading (0.116 12.7 7.4)
    hex (29 30 34 33 41 42 46 45) (20 34 27) simpleGrading (1 12.7 7.4)
    hex (30 31 35 34 42 43 47 46) (41 34 27) simpleGrading (21.7 12.7 7.4)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 16 12) (4 8 20 16)
            (12 16 28 24) (16 20 32 28)
            (24 28 40 36) (28 32 44 40)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 15 19 7) (7 19 23 11)
            (15 27 31 19) (19 31 35 23)
            (27 39 43 31) (31 43 47 35)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 12 13 1) (1 13 14 2) (2 14 15 3)
            (12 24 25 13) (14 26 27 15)
            (24 36 37 25) (25 37 38 26) (26 38 39 27)
        );
    }
    building
    {
        type wall;
        faces
        (
            (13 25 29 17)
            (14 18 30 26)
            (17 29 30 18)
            (13 17 18 14)
            (25 26 30 29)
        );
    }
    up
    {
        type symmetryPlane;
        faces
        (
            (8 9 21 20) (9 10 22 21) (10 11 23 22)
            (20 21 33 32) (21 22 34 33) (22 23 35 34)
            (32 33 45 44) (33 34 46 45) (34 35 47 46)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            // z = 0
            (0 1 5 4) (1 2 6 5) (2 3 7 6)
            (4 5 9 8) (5 6 10 9) (6 7 11 10)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            // z = 40
            (36 40 41 37) (37 41 42 38) (38 42 43 39)
            (40 44 45 41) (41 45 46 42) (42 46 47 43)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //