OpenFOAMSetting/AijCaseA-Les-LogInlet-Smag-LUST-StrGrid-T200/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312 (www.openfoam.com)              |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Each CPU core for each domain
numberOfSubdomains  32;

// Decomposition method
method          simple;

// Configuration for simple
simpleCoeffs
{
    n           (4 4 2);
}

// ************************************************************************* //