OpenFOAMSetting/AijCaseA-Les-LogInlet-Smag-LUST-StrGrid-T200/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    // This name can be randomly chosen.
    U
    {
        field       U;
        
        expression  "vector(10.0 * log((pos().y() + 1.0) / 1.0) / log(11.0 / 1.0), 0, 0)";
        
        // Keep the original boundary condition.
        keepPatches true;          
    }
);